invoice-data/invoice-data-schemas/src/main/wsdl/interactions/GetPendingInvoiceDataInteraction/GetPendingInvoiceDataResponder_1.0.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
  Licensed to the Apache Software Foundation (ASF) under one
  or more contributor license agreements. See the NOTICE file
  distributed with this work for additional information
  regarding copyright ownership. Sveriges Kommuner och Landsting licenses this file
  to you under the Apache License, Version 2.0 (the
  "License"); you may not use this file except in compliance
  with the License. You may obtain a copy of the License at
  
  http://www.apache.org/licenses/LICENSE-2.0
  
  Unless required by applicable law or agreed to in writing,
  software distributed under the License is distributed on an
  "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  KIND, either express or implied. See the License for the
  specific language governing permissions and limitations
  under the License.
-->		
<wsdl:definitions name='GetPendingInvoiceDataInteraction' xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' 
  xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' 
  xmlns:xs='http://www.w3.org/2001/XMLSchema' 
  xmlns:tjsr='urn:riv:sll:invoicedata:GetPendingInvoiceDataResponder:1' 
  xmlns:tns='urn:riv:sll:invoicedata:GetPendingInvoiceData:1:rivtabp21' 
  targetNamespace='urn:riv:sll:invoicedata:GetPendingInvoiceData:1:rivtabp21' 
  xmlns:itr='urn:riv:itintegration:registry:1'>
  <wsdl:documentation>
    Tjänsteinteraktionens namn: GetPendingInvoiceDataInteraction
    Beskrivning: 
  </wsdl:documentation>
  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:sll:invoicedata:GetPendingInvoiceData:1:rivtabp21'>
      <xs:import schemaLocation='GetPendingInvoiceDataResponder_1.0.xsd' namespace='urn:riv:sll:invoicedata:GetPendingInvoiceDataResponder:1' />
      <xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd' namespace='urn:riv:itintegration:registry:1' />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='GetPendingInvoiceDataRequest'>
    <wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
      <wsdl:documentation>Logical address description</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:GetPendingInvoiceDataRequest' />
  </wsdl:message>
  <wsdl:message name='GetPendingInvoiceDataResponse'>
    <wsdl:part name='parameters' element='tjsr:GetPendingInvoiceDataResponse' />
  </wsdl:message>
  <wsdl:portType name='GetPendingInvoiceDataResponderInterface'>
    <wsdl:operation name='GetPendingInvoiceData'>
      <wsdl:input message='tns:GetPendingInvoiceDataRequest' />
      <wsdl:output message='tns:GetPendingInvoiceDataResponse' />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='GetPendingInvoiceDataResponderBinding' type='tns:GetPendingInvoiceDataResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='GetPendingInvoiceData'>
      <soap:operation soapAction='urn:riv:sll:invoicedata:GetPendingInvoiceDataResponder:1:GetPendingInvoiceData' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:GetPendingInvoiceDataRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='GetPendingInvoiceDataResponderService'>
    <wsdl:port name='GetPendingInvoiceDataResponderPort' binding='tns:GetPendingInvoiceDataResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
