invoice-data-performance/src/test/resources/data/GetPendingInvoiceData_OK.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:sll:invoicedata:GetPendingInvoiceDataResponder:1">
   <soapenv:Header>
      <urn:LogicalAddress>?</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:GetPendingInvoiceDataRequest>?</urn1:GetPendingInvoiceDataRequest>
   </soapenv:Body>
</soapenv:Envelope>